[
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "1",
        "rollMax" : "1",
        "description" : "You are embarassed by your poor showing, but nothing remarkable happens.",
        "effect" : "You miss your attack."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "2",
        "rollMax" : "5",
        "description" : "You get wrapped up in your spellcasting and forget to watch your target.",
        "effect" : "Your target has advantage on their first attack roll against you next round."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "6",
        "rollMax" : "9",
        "description" : "You get wrapped up in your spellcasting and forget to watch your surroundings.",
        "effect" : "All enemies have advantage on their first attack roll against you next round."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "10",
        "rollMax" : "14",
        "description" : "You are so wrapped up in your spellcasting that you forget you are fighting a battle.",
        "effect" : "All enemies have advantage on their attack rolls against you until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "15",
        "rollMax" : "19",
        "description" : "Your spell creates a large plume of smoke obscuring your location.",
        "effect" : "The area in a 5 foot radius around your location becomes heavily obscured for 1 minute. A strong breeze can blow away the smoke in 1 round."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "20",
        "rollMax" : "29",
        "description" : "Your spell misfires knocking you over.",
        "effect" : "You are knocked prone."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "30",
        "rollMax" : "39",
        "description" : "The spell fires in an unexpected manner, causing your confidence in your abilities to falter.",
        "effect" : "You have disadvantage on any spell attacks, and enemies have advantage against your spell savings throws until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "40",
        "rollMax" : "49",
        "description" : "The placement of your spell startles your allies near your target, causing them to drop their guard.",
        "effect" : "Your target is able to use their reaction to take an attack of opportunity on one of your allies in melee range."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "50",
        "rollMax" : "59",
        "description" : "You scramble the ingredients of your component pouch or your focus becomes overloaded with magical energy and temporarily stops working.",
        "effect" : "You are unable to perform material components to cast spells until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "60",
        "rollMax" : "69",
        "description" : "Your arm cramps as you cast.",
        "effect" : "You are unable to perform somatic components to cast spells until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "70",
        "rollMax" : "79",
        "description" : "You bite your tongue as you cast.",
        "effect" : "You are unable to use verbal components to cast spells until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "80",
        "rollMax" : "84",
        "description" : "Your spell misfires and dazes you, causing you to lose track of the fight.",
        "effect" : "End your turn and move to the bottom of the initiative order at the start of the next round."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "85",
        "rollMax" : "89",
        "description" : "Your spell misfires causing you to panic.",
        "effect" : "End your current turn and you are surprised until the end of your next turn."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "90",
        "rollMax" : "94",
        "description" : "Your spell backfires creating a small explosion causing you to fall and bump your head.",
        "effect" : "You fall prone. Roll a DC 10 constitution save, on failure you take 1d6 bludeoning damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "95",
        "rollMax" : "99",
        "description" : "Your spell backfires creating a large explosion causing you to fall and bump your head.",
        "effect" : "You fall prone. Roll a DC 15 constitution save, on failure you take 1d6 bludgeoning damage, 1d6 thunder damage, and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious."
    },
    {   "type" : "spell",
        "action" : "fumble",
        "rollMin" : "100",
        "rollMax" : "100",
        "description" : "Your spell completely backfires creating a large explosion causing you to fall and bump your head.",
        "effect" : "You hit yourself with your spell. If the spell effect is instant you take the full effect. If the spell requires concentration the effect persists until the end of your next turn. You also fall prone, take 1d6 bludgeoning damage, 1d6 thunder damage, and become unconscious for 1 minute or until you receive damage from any source."
    }
]
