[
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "1",
        "rollMax" : "1",
        "description" : "You feel accomplished, but nothing remarkable happens.",
        "effect" : "Regular Critical Hit"
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "2",
        "rollMax" : "5",
        "description" : "You feel it is imperative to press the advantage no matter the cost.",
        "effect" : "You can choose to gain advantage on all attacks against your target until the end of your next turn, but if you do all enemies have advantage on their attack rolls against you until the end of your next turn."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "6",
        "rollMax" : "9",
        "description" : "You feel it is imperative to press the advantage, but maintain awareness of your surroundings.",
        "effect" : "You can choose to gain advantage on all attacks against your target next turn, your target has advantage on their attack rolls against you until the end of your next turn."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "10",
        "rollMax" : "14",
        "description" : "You know how to press the advantage.",
        "effect" : "You gain advantage on all attacks against your target until the end of your next turn."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "15",
        "rollMax" : "19",
        "description" : "As you are fighting, you notice an effective route to escape danger.",
        "effect" : "You are able to use the disengage action after your attack."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "20",
        "rollMax" : "24",
        "description" : "You feel the eb and flow of the battle, and know where to make your next move.",
        "effect" : "After your turn you move to the top of the initiative order."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "25",
        "rollMax" : "29",
        "description" : "You begin to recognize patterns in your opponents fighting technique.",
        "effect" : "You gain +2 to your AC against your target, and advantage on all savings throws from effects originating from your target until your next turn."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "30",
        "rollMax" : "39",
        "description" : "You are able to maneuver towards your opponent while attacking, and attempt to harass them.",
        "effect" : "After your attack you can choose to attempt to grapple your opponent if you have a free hand, or attempt to shove your opponent if both hands are in use."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "40",
        "rollMax" : "49",
        "description" : "You are able to maneuver towards your opponent while attacking and harass them.",
        "effect" : "After your attack you can choose to automatically succeed in grappling your opponent if you have a free hand, or shoving your opponent if both hands are in use."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "50",
        "rollMax" : "59",
        "description" : "You attempt to disarm your opponent.",
        "effect" : "You are able to take the disarm action after your attack"
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "60",
        "rollMax" : "69",
        "description" : "You kick your target’s weapon out of their hands.",
        "effect" : "You are able to take the disarm action after your attack, and can steal your opponents weapon if you have a free hand. Otherwise you can knock it up to 20 feet away."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "70",
        "rollMax" : "74",
        "description" : "Your senses heighten and you become aware of threats around the battlefield.",
        "effect" : "You are able to use the dodge action after your attack."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "75",
        "rollMax" : "79",
        "description" : "Your attack knocks your target over.",
        "effect" : "Your target is knocked prone."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "80",
        "rollMax" : "84",
        "description" : "Your strike surprises your opponent.",
        "effect" : "Your target is surprised until the end of their next turn."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "85",
        "rollMax" : "89",
        "description" : "You strike with great force.",
        "effect" : "Roll an additional set of damage dice above and beyond your normal critical roll."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "90",
        "rollMax" : "94",
        "description" : "You strike with extreme force.",
        "effect" : "Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers one unit of exhaustion."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "95",
        "rollMax" : "99",
        "description" : "You strike with debilitating force.",
        "effect" : "Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers a permanent injury chosen by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar."
    },
    {   "type" : "weapon",
        "action" : "hit",
        "rollMin" : "100",
        "rollMax" : "100",
        "description" : "You strike with devastating force.",
        "effect" : "Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers 1 unit of exhaustion, and the target suffers a permanent injury chosen by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar."
    }
]
