[
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "1",
        "rollMax" : "1",
        "description" : "You are embarassed by your poor showing, but nothing remarkable happens.",
        "effect" : "You miss your attack."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "2",
        "rollMax" : "5",
        "description" : "You lose your combat footing, exposing yourself to your target.",
        "effect" : "Your target has advantage on their first attack roll against you next round."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "6",
        "rollMax" : "9",
        "description" : "You lose your combat footing, exposing yourself to your enemies.",
        "effect" : "Your enemies have advantage on their first attack roll against you next round."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "10",
        "rollMax" : "14",
        "description" : "You lose your combat footing, and have difficulty recovering.",
        "effect" : "Your enemies have advantage on their attack rolls against you until the end of your next turn."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "15",
        "rollMax" : "19",
        "description" : "Melee: You get tangled with your enemy and fall over. Ranged: You spill your quiver.",
        "effect" : "Melee: You are knocked prone and your movement is reduced to 0. Your target must succeed a DC 10 dexterity check or they are also knocked prone. Ranged: You must pick up arrows individually from the ground using your “environmental interaction”, or the “Use an Object” action to nock your bow."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "20",
        "rollMax" : "29",
        "description" : "You lose your balance while attacking.",
        "effect" : "You fall prone and your movement is reduced to 0."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "30",
        "rollMax" : "39",
        "description" : "As you attack your opponent you begin to fear that they are the superior combatant.",
        "effect" : "Disadvantage on your next attack roll against your target."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "40",
        "rollMax" : "49",
        "description" : "You miss an attack and gaze upon the chaos of the battle, causing your confidence to falter.",
        "effect" : "Disadvantage on your next attack roll against any target."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "50",
        "rollMax" : "59",
        "description" : "You lose your grip as you attack.",
        "effect" : "Roll a DC 10 Dexterity Check, on failure you drop your weapon at your feet."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "60",
        "rollMax" : "69",
        "description" : "Melee: The weapon slips from your hand as you attack. Ranged: Your ammunition gets lodged in its container.",
        "effect" : "Melee: Roll a DC 10 Dexterity Check, on failure you throw your weapon into your enemy’s space. DM determines where the item is thrown on large sized or greater creatures. Ranged: You must use an action to organize the ammunition in its case before you can make another ranged attack."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "70",
        "rollMax" : "79",
        "description" : "Melee: You lunge past an enemy exposing yourself to his attack. Ranged: Your missile startles your allies near your target.",
        "effect" : "Melee: Enemy you were attacking is able to use their reaction to perform and attack of opportunity. Ranged: the target can perform an opportunity attack on any ally within melee range."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "80",
        "rollMax" : "84",
        "description" : "Missing what you thought was a critical blow causes you to panic.",
        "effect" : "End your current turn and you are surprised until the end of your next turn."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "85",
        "rollMax" : "89",
        "description" : "You attack wildly and lose track of the fight around you.",
        "effect" : "End your turn and move to the bottom of the initiative order at the start of the next round."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "90",
        "rollMax" : "94",
        "description" : "You lose your footing while attacking and fall to the ground bumping your head.",
        "effect" : "You fall prone. Roll a DC 10 constitution save, on failure you take 1d6 damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "95",
        "rollMax" : "99",
        "description" : "You lose your footing while attacking and fall head first.",
        "effect" : "You fall prone. Roll a DC 15 constitution save, on failure you take 2d6 damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious."
    },
    {   "type" : "weapon",
        "action" : "fumble",
        "rollMin" : "100",
        "rollMax" : "100",
        "description" : "You lose your footing while attacking and slam your head into the ground.",
        "effect" : "You fall prone, take 3d6 damage, and become unconscious for 1 minute or until you receive damage from any source."
    }
]
